#1
print("Загадка 1: \nБез окон и дверей, полна глазами лес.\nЧто это?")
answer1 = input()
if answer1.lower() == "елка" or answer1.lower() == "ёлка":
    print("Правильно!")
else:
    print("Неправильно!")
#2
print("Загадка 2: \nНикто не видит, а все знают. Разговаривает, а не шевелится.\nЧто это?")
answer2 = input()
if answer2.lower() == "эхо":
    print("Правильно!")
else:
    print("Неправильно!")
#3
print("Загадка 3: \nДва брата — венцокардиналова,\nСтарший б без труда родился в Ватикане,\nА младший – в любой точке земного шара.\nЧто это?")
answer3 = input()
if answer3.lower() == "северный и южный полюс":
    print("Правильно!")
else:
    print("Неправильно!")